
#+TITLE: SIR-recovery
#+AUTHOR: Ramakrishna Suresh
#+PROPERTY: header-args:julia-vterm :session *julia* :results output :exports both :dir (projectile-project-root) :comment both :tangle yes
#+STARTUP: inlineimages overview

* Creating and saving the toy dataset

We create a struct named ~SIRParams~ containing the rate constants \beta and \gamma to be
used in our model. The current workflow assumes the usage of structs to avoid
mistakes with indexed parameters and possible typos.
#+begin_src julia-vterm
struct SIRParams{T<:AbstractFloat}
    β::T   # infection rate in normalized I-equation
    γ::T   # recovery rate  in normalized I-equation
end
#+end_src

#+RESULTS:
: Executing... dc68c4b8

To create the toy dataset, we use the following model equations for and SIR
model:

#+NAME: eq:prelim-SIR-true
\begin{subequations}
\begin{align}
&\frac{dS}{dt} = -\beta \cdot S \cdot I \\
&\frac{dI}{dt} = \beta \cdot S \cdot I - \gamma \cdot I\\
&\frac{dR}{dt} = \gamma \cdot I
\end{align}
\end{subequations}

The default parameters are as follows:

#+NAME: table:SIR-true-params
#+ATTR_LATEX: :align ccc
#+CAPTION: True parameters used by SIR model equations [[eq:prelim-SIR-true]] to generate mock data.
|-----------+-------------------+-------|
| Parameter | Parameter Name    | Value |
|-----------+-------------------+-------|
| \beta         | Transmission Rate |   1.5 |
| \gamma         | Recovery Rate     |     1 |
|-----------+-------------------+-------|
We use ~DifferentialEquations.jl~ package syntax to solve the known ODE system
over the timespan ~t_span~ \in [0, 6]. Random multiplicative noise is assumed and is
added to the solution to create the noisy dataset. The following code block can
be uncommented to generate the dataset. To maintain consistency with the
published results, the CSV file named ~SIR_train.csv~, generated by running the
following code block, will be used for all analyses hereon.

#+begin_src julia-vterm

# # SIR model method for DifferentialEquations call 
# function SIR_model!(du, u, p::SIRParams, t)
#     S, I, R = u
#     du[1] = -p.β * S * I 
#     du[2] =  p.β * S * I - p.γ * I
#     du[3] =  p.γ * I
# end

# # Fast default RNG. Does not get messed up with a global RNG
# rng = Random.MersenneTwister(42)

# # Start with our true known parameters
# true_SIR_par = SIRParams(1.5f0, 1f0)
# t_span = (0.0f0, 6.0f0)
# N_obs = 101

# # Collect seems to turn an iterable into an array
# t_obs_array = range(t_span[1], t_span[2], length=N_obs) |> collect
# u0 = [3, 0.001, 0.0]

# # solve the ODE to get a solution object
# prob = DifferentialEquations.ODEProblem(SIR_model!, u0, t_span, true_SIR_par)
# sol = DifferentialEquations.solve(
#     prob,
#     DifferentialEquations.Tsit5();
#     saveat = t_obs_array
# )
# # Convert the solution object into an Array
# sol_ = Array(sol)

# # multiplicative % noise via lognormal, unbiased & positive 
# noise_pct = 0.2
# ε = Random.randn(rng, size(sol_)...)
# noisy_data = sol_ .* exp.(noise_pct .* ε .- 0.5 * noise_pct^2) 
# noisy_data = clamp.(noisy_data, 0, Inf32)

# # Convert to Float32 to keep everyone happy
# t_train = Float32.(t_obs_array)
# Y_train = Float32.(noisy_data)
# y0_obs  = sol_[:, 1]     # IC for penalty

# Y_train_std = Statistics.std(Y_train, dims=2);
# Y_max = maximum(Y_train; dims=2)

# # Split true (ODE) solution
# S_true = sol_[1, :]
# I_true = sol_[2, :]
# R_true = sol_[3, :]

# # Split noisy measurements
# S_noisy = Y_train[1, :]
# I_noisy = Y_train[2, :]
# R_noisy = Y_train[3, :]

# # Construct a DataFrame for saving
# df = DataFrame(
#     t       = t_train,
#     S_true  = Float32.(S_true),
#     I_true  = Float32.(I_true),
#     R_true  = Float32.(R_true),
#     S = S_noisy,
#     I = I_noisy,
#     R = R_noisy,
# )

# CSV.write(
#     joinpath(pwd(), "Results", "SIR_train.csv"),
#     df
# )
#+end_src

#+RESULTS:

* Visualizing the final fit results

The final fit $\mathrm{u}$'s predictions are overlayed on the training dataset.

#+begin_src julia-vterm

using CairoMakie, Makie
# --- Evaluate the model as before ---
smodel = state_model(res.params, res.ctx2)

t_plot = Float32.(collect(range(first(t_span), last(t_span), length = 200)))
t_plot = permutedims(t_plot)            # (1, N)
tvec   = vec(t_plot)                    # (N,)

sŷ = smodel(t_plot)                    # size ≈ (3, length(tvec))

# --- Figure + theme ---
fig = Figure(size = (800, 600), fontsize = 14)

# Common axis styling
axis_kwargs = (
    xlabel = "Time t",
    ylabel = "Population",
    xgridvisible = true,
    ygridvisible = true,
    topspinevisible = false,
    rightspinevisible = false,
    xticklabelsize = 10,
    yticklabelsize = 10,
    titlesize = 14,
    titlealign = :left,
)

# Arrange as 3 stacked panels with shared x
axS = CairoMakie.Axis(fig[1, 1]; title = "Susceptible S(t)", axis_kwargs...)
axI = CairoMakie.Axis(fig[2, 1]; title = "Infectious I(t)", axis_kwargs...)
axR = CairoMakie.Axis(fig[3, 1]; title = "Recovered R(t)", axis_kwargs...)

Makie.linkxaxes!(axS, axI, axR)

# --- Plot model vs data ---
# Use consistent, print-friendly styling
line_kwargs = (color = :black, linewidth = 2)
scatter_kwargs = (marker = :circle, markersize = 7,
                  color = :white, strokecolor = :black, strokewidth = 1.5)


ldS = lines!(axS, t_train[1, :], S_true./Y_max[1]; label = "True Model", line_kwargs...)
ldI = lines!(axI, t_train[1, :], I_true./Y_max[2]; label = "True Model", line_kwargs...)

ldR = lines!(axR, t_train[1, :], R_true./Y_max[3]; label = "True Model", line_kwargs...)

lS = lines!(axS, tvec, sŷ[1, :]; label = "NN(t, θ_u)", line_kwargs...)
sS = scatter!(axS, vec(t_train), Y_train[1, :]; label = "Data", scatter_kwargs...)

lI = lines!(axI, tvec, sŷ[2, :]; label = "NN(t, θ_u)", line_kwargs...)
sI = scatter!(axI, vec(t_train), Y_train[2, :]; label = "Data", scatter_kwargs...)

lR = lines!(axR, tvec, sŷ[3, :]; label = "NN(t, θ_u)", line_kwargs...)
sR = scatter!(axR, vec(t_train), Y_train[3, :]; label = "Data", scatter_kwargs...)

# --- Single shared legend at the top or bottom ---
Legend(fig[0, 1], [ldS,lS, sS], ["True Model", "NN(t, θ_g)", "Data"], orientation = :horizontal, tellwidth = false)
# alternatively at bottom:
# Legend(fig[4, 1], [lS, sS], ["NN(t, θ_g)", "Data"], orientation = :horizontal)

display(fig)

# save(
#     joinpath(pwd(), "Results", "SIR_NN_fit.pdf"),
#     fig,
#     px_per_unit = 600/72
#     )
# save("sir_fit.pdf", fig, pt_per_unit = 1.0)
# save("sir_fit.png", fig, px_per_unit = 3.0)

#+end_src

#+RESULTS:
: Executing... ddfe93e8

The fit $\mathrm{g}$ for each state is overlayed on ground truth.

#+begin_src julia-vterm
using CairoMakie
using Makie  

g1 = -1.5 .* S_true .* I_true ./ Y_max[1]
g2 = 1 .* I_true ./ Y_max[3]

g_true = permutedims(hcat(g1,g2))
# --- Evaluate explicit g-model ---
gmodel = g_model(res.params, res.ctx2)

t_plot = Float32.(collect(range(first(t_span), last(t_span), length = 200)))
t_plot = permutedims(t_plot)             # 1×N
tvec   = vec(t_plot)

gŷ = gmodel(t_plot)                     # should return 2×N or 3×N


# --- Figure setup ---
fig = CairoMakie.Figure(size = (900, 350), fontsize = 14)

axis_kwargs = (
    xlabel = "Time",
    ylabel = "Rate",
    xgridvisible = true,
    ygridvisible = true,
    topspinevisible = false,
    rightspinevisible = false,
    xticklabelsize = 10,
    yticklabelsize = 10,
    titlesize = 14,
    titlealign = :left,
)

axS = CairoMakie.Axis(fig[1, 1]; title = "g_S(t, θ_g)", axis_kwargs...)
axR = CairoMakie.Axis(fig[1, 2]; title = "g_R(t, θ_g)", axis_kwargs...)

# Link x-axes if supported by your Makie version

Makie.linkxaxes!(axS, axR)



# --- Plot styling ---
trained_kwargs = (color = :black, linewidth = 2)
nn_kwargs      = (color = :gray, linestyle = :dash, linewidth = 2)

# g_S
lS_trained = CairoMakie.lines!(axS, tvec, gŷ[1, :]; label = "g trained", trained_kwargs...)
lS_nn      = CairoMakie.lines!(axS, vec(t_train),  g_true[1, :]; label = "g from NN", nn_kwargs...)

# g_R
lR_trained = CairoMakie.lines!(axR, tvec, gŷ[2, :]; label = "g trained", trained_kwargs...)
lR_nn      = CairoMakie.lines!(axR, vec(t_train),  g_true[2, :]; label = "g from NN", nn_kwargs...)

# --- Shared legend ---
CairoMakie.Legend(fig[2, 1:2], [lS_trained, lS_nn],
                  ["g trained", "g true"],
                  orientation = :horizontal, tellwidth = false)

# CairoMakie.save(
#     joinpath(project_root_dir, "Results", "SIR_g_visualization.pdf"),
#     fig; px_per_unit = 300/72)
display(fig)


# --- 300 dpi export ---
# DPI = px_per_unit * 72 → px_per_unit = 300 / 72
#+end_src

#+RESULTS:

* Using symbolic regression

#+begin_src julia-vterm

using SymbolicRegression

# 1. Get state and g models on the dense training grid
ps  = res.params
ctx = res.ctx2

smodel = state_model(ps, ctx)
gmodel = g_model(ps, ctx)

t_dense = ctx.t_dense              # 1×B, same grid used in training
t_vec   = vec(t_dense)             # B

# Forward passes (normalized coordinates)
Ỹ = smodel(t_dense)               # 3×B, (Ŝ, Ĩ, Ř)
G̃ = gmodel(t_dense)               # 2×B, (g_S, g_R) for S and R eqs

# 2. Extract features and targets, promote to Float64 for SR
Ŝ = Float64.(Ỹ[1, :])
Ĩ = Float64.(Ỹ[2, :])
Ř = Float64.(Ỹ[3, :])
t = Float64.(t_vec)

g_S = Float64.(G̃[1, :])
g_R = Float64.(G̃[2, :])

# 3. Feature matrix for SymbolicRegression.jl

X = permutedims(hcat(Ŝ, Ĩ, Ř))  # (3 × B)
#+end_src

#+RESULTS:


#+begin_src julia-vterm

opts_S = SymbolicRegression.Options(
    binary_operators = [+, -, *],
    unary_operators  = [],
    npopulations     = 30,
    maxsize          = 20,
)

hall_of_fame_R = SymbolicRegression.EquationSearch(
    X, g_S;
    niterations = 200,
    options     = opts_S,
    # parallelism = :multithreading,
    progress    = false,
    # verbosity   = 0,
    variable_names   = ["S_norm", "I_norm", "R_norm"],
)

dominating_R = SymbolicRegression.calculate_pareto_frontier(hall_of_fame_R)
trees_R      = [m.tree for m in dominating_R]
#+end_src

#+RESULTS:

#+begin_src julia-vterm

opts_R = SymbolicRegression.Options(
    binary_operators = [+, -, *],
    unary_operators  = [],
    npopulations     = 30,
    maxsize          = 20,
)

hall_of_fame_R = SymbolicRegression.EquationSearch(
    X, g_R;
    niterations = 200,
    options     = opts_R,
    # parallelism = :multithreading,
    progress    = false,
    # verbosity   = 0,
    variable_names   = ["S", "I", "R"],
)

dominating_R = SymbolicRegression.calculate_pareto_frontier(hall_of_fame_R)
trees_R      = [m.tree for m in dominating_R]
#+end_src

#+RESULTS:
: Executing... 44de58ef
